Revit 2024 API
BuiltInFailures.PathOfTravelFailures Class
 Failures about PathOfTravel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class PathOfTravelFailures
Visual Basic
Public NotInheritable Class PathOfTravelFailures
Visual C++
public ref class PathOfTravelFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures
See Also
BuiltInFailures.PathOfTravelFailures Members
Autodesk.Revit.DB Namespace